## DNS
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 0 to change, 4 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_route53_record._acme-challenge-energy-information-alpha-canada-ca-CNAME must be replaced
-/+ resource "aws_route53_record" "_acme-challenge-energy-information-alpha-canada-ca-CNAME" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "_acme_challenge.energy-information.alpha.canada.ca" -> (known after apply)
      ~ id              = "Z33C47YI9EN8XL__acme_challenge.energy-information.alpha.canada.ca_CNAME" -> (known after apply)
      ~ name            = "_acme_challenge.energy-information.alpha.canada.ca" -> "_acme-challenge.energy-information.alpha.canada.ca" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_route53_record._acme-challenge-information-energie-alpha-canada-ca-CNAME must be replaced
-/+ resource "aws_route53_record" "_acme-challenge-information-energie-alpha-canada-ca-CNAME" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "_acme_challenge.information-energie.alpha.canada.ca" -> (known after apply)
      ~ id              = "Z33C47YI9EN8XL__acme_challenge.information-energie.alpha.canada.ca_CNAME" -> (known after apply)
      ~ name            = "_acme_challenge.information-energie.alpha.canada.ca" -> "_acme-challenge.information-energie.alpha.canada.ca" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_route53_record._acme-challenge-statistics-alpha-canada-ca-CNAME must be replaced
-/+ resource "aws_route53_record" "_acme-challenge-statistics-alpha-canada-ca-CNAME" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "_acme_challenge.statistics.alpha.canada.ca" -> (known after apply)
      ~ id              = "Z33C47YI9EN8XL__acme_challenge.statistics.alpha.canada.ca_CNAME" -> (known after apply)
      ~ name            = "_acme_challenge.statistics.alpha.canada.ca" -> "_acme-challenge.statistics.alpha.canada.ca" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_route53_record._acme-challenge-statistique-alpha-canada-ca-CNAME must be replaced
-/+ resource "aws_route53_record" "_acme-challenge-statistique-alpha-canada-ca-CNAME" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "_acme_challenge.statistique.alpha.canada.ca" -> (known after apply)
      ~ id              = "Z33C47YI9EN8XL__acme_challenge.statistique.alpha.canada.ca_CNAME" -> (known after apply)
      ~ name            = "_acme_challenge.statistique.alpha.canada.ca" -> "_acme-challenge.statistique.alpha.canada.ca" # forces replacement
        # (4 unchanged attributes hidden)
    }

Plan: 4 to add, 0 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.alpha-canada-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.cds-snc-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.notification-canada-ca-public"]

20 tests, 17 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
